autossh
base
base-devel
brightnessctl
chromium
cmake
code
cpio
discord
efibootmgr
fastfetch
ffmpegthumbnailer
file-roller
git
grim
grub
htop
hyprland
hyprpaper
jq
kitty
libreoffice-fresh
linux
linux-firmware
linux-headers
lsof
mpv
network-manager-applet
networkmanager
nftables
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
nvidia-open-dkms
nvidia-settings
nvidia-utils
os-prober
pacman-contrib
pamixer
pavucontrol
pipewire-alsa
pipewire-pulse
playerctl
polkit-gnome
protonplus
proxychains-ng
qt6-multimedia-ffmpeg
qt6-virtualkeyboard
reflector
rofi
sddm
slurp
spotify
steam
sudo
swappy
tailscale
tela-icon-theme
telegram-desktop
thunar
thunar-archive-plugin
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-roboto
tumbler
vim
waybar
wayland
wayland-protocols
wayvnc
wireplumber
wl-clipboard
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs
yay
yay-debug
