abseil-cpp
acl
ada
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
aml
aom
appstream
appstream-glib
aquamarine
archlinux-keyring
argon2
at-spi2-core
atkmm
attr
audit
autoconf
automake
autossh
avahi
ayatana-ido
base
base-devel
bash
bash-completion
binutils
bison
blueman
bluez
bluez-libs
bluez-utils
boost-libs
breeze-icons
brightnessctl
brotli
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cairomm-1.16
chromium
clang
clang21
clucene
cmake
code
compiler-rt
compiler-rt21
coreutils
cpio
cppdap
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
discord
dkms
double-conversion
duktape
e2fsprogs
efibootmgr
efivar
egl-gbm
egl-wayland
egl-wayland2
egl-x11
eglexternalplatform
electron39
exo
expat
fakeroot
fastfetch
ffmpeg
ffmpegthumbnailer
fftw
file
file-roller
filesystem
findutils
firefox
flac
flex
fmt
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse3
gawk
gc
gcc
gcc-libs
gcr-4
gdbm
gdk-pixbuf2
geoclue
gettext
giflib
git
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
glycin
gmp
gnulib-l10n
gnupg
gnutls
go
gobject-introspection
gobject-introspection-runtime
gperftools
gpgme
gpgmepp
gpm
gpsd
granite7
graphene
graphite
grep
grim
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base-libs
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtk4-layer-shell
gtkmm-4.0
gtkmm3
guile
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hicolor-icon-theme
hidapi
hiddify-debug
highway
htop
hunspell
hwdata
hyphen
hyprcursor
hyprgraphics
hyprland
hyprland-guiutils
hyprlang
hyprpaper
hyprtoolkit
hyprutils
hyprwayland-scanner
hyprwire
iana-etc
icu
iniparser
iproute2
iptables
iputils
iso-codes
jack2
jansson
jasper
jbigkit
jemalloc
jp2a
jq
json-c
json-glib
jsoncpp
karchive
kbd
kbookmarks
kcodecs
kcolorscheme
kcompletion
kconfig
kcontacts
kcoreaddons
kcrash
kdbusaddons
kdeclarative
kdeconnect
keyutils
kglobalaccel
kguiaddons
ki18n
kiconthemes
kio
kirigami
kirigami-addons
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmod
knotifications
kpeople
krb5
kservice
kstatusnotifieritem
ksvg
kwallet
kwidgetsaddons
kwindowsystem
l-smash
lame
lcms2
leancrypto
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-gmp
lib32-gnutls
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libngtcp2
lib32-libnm
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-nvidia-utils
lib32-openssl
lib32-p11-kit
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libadwaita
libappindicator
libarchive
libasan
libass
libassuan
libasyncns
libatasmart
libatomic
libatomic_ops
libavc1394
libavif
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcmis
libcolord
libcups
libcurl-gnutls
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libde265
libdecor
libdeflate
libdispatch
libdisplay-info
libdovi
libdrm
libdvdnav
libdvdread
libe-book
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfakekey
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libfyaml
libgcc
libgcrypt
libgee
libgfortran
libgirepository
libglvnd
libgomp
libgpg-error
libgtop
libgudev
libheif
libice
libidn2
libiec61883
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libixion
libjpeg-turbo
libjxl
libksba
liblangtag
liblc3
libldac
libldap
libliftoff
liblsan
libmakepkg-dropins
libmbim
libmd
libmfx
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpdclient
libmspub
libmwaw
libmysofa
libnautilus-extension
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnumbertext
libnvme
libobjc
libodfgen
libogg
libopenmpt
liborcus
libp11-kit
libpagemaker
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqmi
libqrtr-glib
libquadmath
libqxp
libraw1394
libreoffice-fresh
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libssh
libssh2
libstaroffice
libstdc++
libstemmer
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent-rasterbar
libtsan
libubsan
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libuv
libva
libvdpau
libverto
libvisio
libvorbis
libvpl
libvpx
libwacom
libwebp
libwireplumber
libwpd
libwps
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxnvctrl
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
linux-headers
llvm
llvm-libs
llvm21
llvm21-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua54
luajit
lv2
lxappearance
lz4
lzo
m4
mailcap
make
man-db
md4c
mdadm
media-player-info
mesa
meson
miniupnpc
minizip
minizip-ng
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpdecimal
mpfr
mpg123
mpv
mtdev
mujs
muparser
ncurses
neatvnc
nekobox-core
nekobox-debug
neon
nettle
network-manager-applet
networkmanager
nftables
ninja
nm-connection-editor
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
nss-mdns
numactl
nvidia-open-dkms
nvidia-settings
nvidia-utils
ocl-icd
oniguruma
openal
opencore-amr
openh264
openjpeg2
openssh
openssl
opus
orc
orchis-theme
os-prober
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pamixer
pango
pangomm
pangomm-2.48
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-pulse
pixman
pkgconf
playerctl
pnpm
polkit
polkit-gnome
poppler
popt
portaudio
ppp
pps-tools
procps-ng
protobuf
protonplus
protonplus-debug
proxychains-ng
psmisc
pugixml
pulseaudio-qt
pyside6
python
python-attrs
python-autocommand
python-cachetools
python-cairo
python-certifi
python-cffi
python-charset-normalizer
python-cryptography
python-filelock
python-gobject
python-idna
python-inputs
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jinja
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-packaging
python-pip
python-pkg_resources
python-platformdirs
python-psutil
python-pyaml
python-pycparser
python-pycryptodomex
python-pyxdg
python-requests
python-setuptools
python-six
python-steam
python-tqdm
python-typing_extensions
python-urllib3
python-vdf
python-wheel
python-yaml
python-zstandard
qbittorrent
qca-qt6
qqc2-desktop-style
qt6-5compat
qt6-base
qt6-connectivity
qt6-declarative
qt6-imageformats
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-shadertools
qt6-svg
qt6-tools
qt6-translations
qt6-virtualkeyboard
qt6-wayland
quickshell
raptor
rasqal
rav1e
re2
readline
redland
reflector
rhash
ripgrep
rnnoise
rofi
rtkit
rubberband
sbc
sdbus-cpp
sddm
sdl2-compat
sdl3
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
shiboken6
simdjson
slang
slurp
snappy
sndio
solid
sonnet
sord
sound-theme-freedesktop
spandsp
spdlog
speex
speexdsp
spirv-tools
spotify
sqlite
sratom
srt
startup-notification
steam
steam-devices
sudo
sunshine
sunshine-bin-debug
sunshine-debug
sunshine-git-debug
svt-av1
swappy
swaylock-effects
swaylock-effects-debug
swaync
systemd
systemd-libs
systemd-sysvcompat
tailscale
tar
tdb
tela-icon-theme
telegram-desktop
texinfo
thrift
thunar
thunar-archive-plugin
tinysparql
tomlplusplus
tpm2-tss
tslib
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-roboto
tumbler
tzdata
uchardet
udisks2
upower
usbutils
util-linux
util-linux-libs
v2ray-domain-list-community
v2ray-geoip
v4l-utils
vapoursynth
vid.stab
vim
vim-runtime
vmaf
volume_key
vulkan-icd-loader
waybar
wayland
wayland-protocols
wayvnc
webrtc-audio-processing-1
which
wireplumber
wl-clipboard
wlogout
wlogout-debug
wpa_supplicant
x264
x265
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-utils
xf86-input-libinput
xfconf
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xkbcomp
xorg-xprop
xorg-xrandr
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yay
yay-debug
yyjson
zenity
zeromq
zimg
zint
zix
zlib
zlib-ng
zsh
zstd
zxing-cpp
