bash-completion
blueman
bluez
bluez-utils
brightnessctl
fastfetch
ffmpegthumbnailer
file-roller
geoclue
grim
htop
hyprland
hyprpaper
jq
kitty
lsof
lxappearance
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
orchis-theme
pacman-contrib
pamixer
pavucontrol
pipewire-alsa
pipewire-pulse
playerctl
polkit-gnome
qt6-multimedia-ffmpeg
quickshell
rofi
slurp
swappy
swaync
thunar
thunar-archive-plugin
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-roboto
tumbler
vim
waybar
wayland
wayland-protocols
wireplumber
wl-clipboard
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs
zsh
